Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData
Struct for passing a BREP part data identifier.
Remarks:
Matches dotDMParameterData_t on TS Core side,
and also equals the generic Tekla.Structures.DirectManipulation.Adapter.Native.dotParameterData on platform side.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.Guid
The unique identifier of the BREP part

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData struct.
guid: The unique identifier of the BREP part.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.GetCurrent(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData@)
Gets the Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value describing the BREP part which is currently being handled by TS core.
brepPartData: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData currently active in TS core, if any.
Returns: True if a BREP part is currently active; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.Equals(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData)
Determines whether the current value is equal to other.
other: The value to compare with.
Returns: True if both values are equal; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.Equals(System.Object)
Determines whether other is of type Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData
and whether the current value is equal to other.
other: The value to compare with.
Returns: True if both values are equal; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.GetHashCode
Gets a hash code for the current value.
Returns: A hash code for the current value.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData.DotExportGetDMBrepTypeID(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotBrepPartData@)
Exports dotExportGetDMBrepTypeID.
brepPartData: BREP part data.
Returns: True on success; otherwise, false.